Metrics class , Readme upd
